---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Zone.ServiceType
source: html/d55f087f-6d1a-99d7-07a7-7806729d4f38.htm
---
# Autodesk.Revit.DB.Mechanical.Zone.ServiceType Property

Get or set the Service Type of the Zone.

## Syntax (C#)
```csharp
public ServiceType ServiceType { get; set; }
```

## Remarks
This property is used to get or set the Service Type of the Zone.